

#include <iostream> // заголовочный файл с классами, функциями и переменными для организации ввода-вывода в языке программирования C++.
using namespace std;

int main() // Точка входа в программу

// Домашняя работа 1
{ // Начало
      setlocale(LC_ALL, ""); // Команда выводящая русские слова на консоль
 //   std::cout << "First string\n"; //Вывод "First string" на консоль, \n нужна для перевода на новую строку
 //   std::cout << "Первая строка\n"; //Вывод "Первая строка" на консоль 
 //   std::cout << "Вторая строка\n"; //Вывод "Вторая строка" на консоль
 //   std::cout << "Строка \"с кавычками\"\n"; // Вывод кавычек "" на консоль
 //   std::cout << "Строка \\с обратным слешом\\\n"; // Вывод обратного слеша \\ на консоль

// Домашняя работа 2
    int f = 150;
    float v = 15.933;
    short g = 250;
    std::cout << "f = " << f << "\n";
    std::cout << "v = " << v << "\n";
    std::cout << "g = " << g << "\n";
    std::cout << "________________________\n";
    short y = 18;
    string h = "Марта";
    string u = "2004 Года";
    std::cout << "Моя дата рождения: " << y << " " << h << " " << u << "\n";
    std::cout << "________________________\n";
    const float o = 2.3;
    const string l = "WINDOWS";
    std::cout << o << " " << l << "\n";

} // Конец


