

#include <iostream> // заголовочный файл с классами, функциями и переменными для организации ввода-вывода в языке программирования C++.
using namespace std;

int main() // Точка входа в программу

// Домашняя работа 1
{ // Начало
      setlocale(LC_ALL, ""); // Команда выводящая русские слова на консоль
 //   std::cout << "First string\n"; //Вывод "First string" на консоль, \n нужна для перевода на новую строку
 //   std::cout << "Первая строка\n"; //Вывод "Первая строка" на консоль 
 //   std::cout << "Вторая строка\n"; //Вывод "Вторая строка" на консоль
 //   std::cout << "Строка \"с кавычками\"\n"; // Вывод кавычек "" на консоль
 //   std::cout << "Строка \\с обратным слешом\\\n"; // Вывод обратного слеша \\ на консоль

// Домашняя работа 2
 //   int f = 150;
 //   float v = 15.933;
 //   short g = 250;
 //   std::cout << "f = " << f << "\n";
 //   std::cout << "v = " << v << "\n";
 //   std::cout << "g = " << g << "\n";
 //   std::cout << "________________________\n";
 //   short y = 18;
 //   string h = "Марта";
 //   string u = "2004 Года";
 //   std::cout << "Моя дата рождения: " << y << " " << h << " " << u << "\n";
 //   std::cout << "________________________\n";
 //   const float o = 2.3;
 //   const string l = "WINDOWS";
 //   std::cout << o << " " << l << "\n";

 // Домашняя работа 3
 //     int a = 23;
 //     int b = 14;
 //     int c = 2;
 //     std::cout << "Сумма = " << a + b + c << "\n";
 //     std::cout << "Разность = " << a - b - c << "\n";
 //     std::cout << "Произведение = " << a * b * c << "\n";
 //     std::cout << "Деление = " << a / b / c << "\n";
 //     std::cout << "Остаток от деления = " << a % b << "\n";
 //     std::cout << (((145 - 100 / 20) / 20) * 50) + 45 << "\n";
 //     int r = 3;
 //     int t = 7;
 //     std::cout << "Логическое умножение, И = " << (r && t) << "\n";
 //     std::cout << "Логическое сложение, ИЛИ = " << (r || t) << "\n";
 //     std::cout << "Побитовое исключающее ИЛИ = " << (r ^ t) << "\n";
 //     std::cout << "Побитовая инверсия = " << (~r) << "\n";
 //     std::cout << "Побитовый сдвиг вправо = " << (r >> 1) << "\n";
 //     std::cout << "Побитовый сдвиг влево = " << (r << 1) << "\n";
 //     bool h = true;
 //     bool k = false;
 //     std::cout << (true && (true && (true && true || false) && (false || true != false))) << "\n";
 //     std::cout << (r && (r && (r && r || t) && (t || r != t))) << "\n";
 //     std::cout << (25 < 48 && (23 > (3 + 15) || (2 < 8 && (5 >= 2 && 15 < 15)))) << "\n";

 // Домашняя работа 4
      int a = 0;
      int b = 0;
      int c = 0;
      std::cout << "Введите a = ";
      std::cin >> a;
      std::cout << "\n";
      std::cout << "Введите b = ";
      std::cin >> b;
      std::cout << "\n";
 //     std::cout << "Среднее арифметическое = " << (a + b) / 2 << "\n";
      std::cout << "Введите операцию 1 = <+> 2 = <-> 3 = <*> 4 = </> == ";
      std::cin >> c;
      std::cout << "\n";
 //     if (c == 1)
 //     {
 //         std::cout << "Сумма = " << a + b << "\n";
 //     }
 //     else if (c == 2)
 //     {
 //         std::cout << "Разность = " << a - b << "\n";
 //     }
 //     else if (c == 3)
 //     {
 //         std::cout << "Произведение = " << a * b << "\n";
 //     }
 //     else if (c == 4)
 //     {
 //         std::cout << "Деление = " << a / b << "\n";
 //     }
 //     else
 //     {
 //         std::cout << "Вы неправильно ввели операцию" << "\n";
 //     }
      switch (c)
      {
      case 1:
          std::cout << "Сумма = " << a + b << "\n";
          break;
      case 2:
          std::cout << "Разность = " << a - b << "\n";
          break;
      case 3:
          std::cout << "Произведение = " << a * b << "\n";
          break;
      case 4:
          std::cout << "Деление = " << a / b << "\n";
          break;
      default:
          std::cout << "Вы неправильно ввели операцию" << "\n";
      }

} // Конец


